[{"date":"2016-01-24T05:08:00Z","id":1,"parent_id":0,"section":"Requested move 16 January 2016","text":"<div class=\"boilerplate\" style=\"background-color: #efe; margin: 2em 0 0 0; padding: 0 10px 0 10px; border: 1px dotted #aaa;\">\n:The following is a closed discussion of a [[WP:requested moves|requested move]]. Please do not modify it. Subsequent comments should be made in a new section on the talk page. Editors desiring to contest the closing decision should consider a [[Wikipedia:move review|move review]]. No further edits should be made to this section. \n\nThe result of the move request was: moved. No objections in over a week. Dicklyon makes a good point about the state of the article, though.","user":"Jenks24"},{"date":"2016-01-16T21:04:00Z","id":2,"parent_id":0,"section":"Requested move 16 January 2016","text":"----\n\n\n[[:Start Up India]] → {{no redirect|Startup India}} – Please place your rationale for the proposed move here. -- Pankaj Jain [[User:Capankajsmilyo|Capankajsmilyo]] ([[User talk:Capankajsmilyo|talk]] · [[Special:Contribs/Capankajsmilyo|contribs]] · [//tools.wmflabs.org/xtools-ec/?user=Capankajsmilyo&project=en.wikipedia.org count]) 19:37, 16 January 2016 (UTC)\n:Support - Though both instances are used in reliable sources, the entity \"Startup\" is one word, which should be reflected in the page name.","user":"Meatsgains"},{"date":"2016-01-17T06:23:00Z","id":3,"parent_id":0,"section":"Requested move 16 January 2016","text":"* Comment – The article is a mess of over-capitalization.  Please fix that and cite good sources, and then we can talk about what name the sources prefer.","user":"Dicklyon"},{"date":"2016-03-01T14:26:00Z","id":4,"parent_id":0,"section":"Definition of startup, Section on Softbank unrelated to subject of the article., Section on performance of states is redundant.","text":"Can section on definition of startup as per government of India be added?\nSection on Softbank is redundant as article deals with government of India initiative called Startup India.\nSection on performance of states is redundant as there has been no action on the ground. No single beneficiary startup exists, till date. No question of being located anywhere in the world.  —Preceding [[Wikipedia:Signatures|unsigned]] comment added by","user":"150.129.159.120"},{"date":"2018-01-21T04:39:00Z","id":5,"parent_id":0,"section":"Cleanup","text":"I did some cleanup to this article and related articles mentioned in the lead. Please feel free to review, rephrase and enhance further. Thanks.","user":"202.156.182.84"},{"date":"2018-01-22T22:20:00Z","id":6,"parent_id":5,"section":"Cleanup","text":"Such claims about synergies and relations between different government schemes must be sourced to independent reliable sources ([[WP:V]], [[WP:RS]]), and might be better placed in a broader article about India's economy instead of 1 specific scheme article. Also, information should be first covered in detail in the main text, before it can be summarized in the introductory lead section ([[MOS:LEAD]]). I have also reverted a few minor glitches in the article's formatting (see [[MOS:LAYOUT]]). Of course all sourced improvements are appreciated nonetheless.","user":"GermanJoe"}]