[{"date":"2020-10-07T07:19:00Z","id":1,"parent_id":0,"section":"Hindustan","text":"India is known as Hindustan in hindi language","user":"Eroberar"},{"date":"2020-10-13T08:14:00Z","id":2,"parent_id":0,"section":"Extended-confirmed-protected edit request on 13 October 2020","text":"{{edit extended-protected|India|answered=yes}}\n","user":"2402:8100:282B:7739:0:0:0:1"},{"date":"2020-10-13T08:21:00Z","id":3,"parent_id":2,"section":"Extended-confirmed-protected edit request on 13 October 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate.","user":"Usedtobecool"},{"date":"2020-10-17T02:11:00Z","id":4,"parent_id":0,"section":"Edit- semi-protected","text":"{{edit semi-protected|India|answered=yes}}\nFor the lead, is it possible to add \"a country located on the Indian peninsula in South Asia\"?","user":"2603:8081:160A:BE2A:B1DE:5BA6:F09F:B7AE"},{"date":"2020-10-17T19:16:00Z","id":5,"parent_id":4,"section":"Edit- semi-protected","text":"[[File:Red information icon with gradient background.svg|20px|link=|alt=]] Not done for now: please establish a [[Wikipedia:Consensus|consensus]] for this alteration [[Wikipedia:Edit requests|before]] using the {{tlx|edit extended-protected}} template. In this case, IP2603+, there is no article on the [[Indian Peninsula]] and no mention of it in this article. The lead must summarize the rest of the article. As you may see by clicking the link, the Indian Peninsula is a subtopic of the Indian subcontinent, which actually is mentioned in this article. Thanks again for your input! [[User:Paine Ellsworth|P.I.Ellsworth]][[Editor|ed.]]","user":"Paine Ellsworth"},{"date":"2020-10-18T11:06:00Z","id":6,"parent_id":5,"section":"Edit- semi-protected","text":"Dear {{re|2603:8081:160A:BE2A:B1DE:5BA6:F09F:B7AE}} \"Peninsula,\" from  [[classical Latin]] paeninsula < paene pene- prefix (\"nearly, almost, all but) + insula island has the meaning of \"A piece of land that is almost completely surrounded by water; a piece of land projecting into water, such that the greater part of its boundary is coastline.\" (OED, Third edition, 2005, online, subscription reqd.) Not all of India is peninsular; the Indian Himalayas, for example, are not, the Punjab is not. There is in fact a WP page [[Peninsular India]] which redirects to [[South India]].  Best regards,","user":"Fowlerfowler"},{"date":"2020-10-18T11:23:00Z","id":7,"parent_id":6,"section":"Edit- semi-protected","text":"PS Your proposal is not entirely without precedence in terms of usage, but it is obsolete usage.  It used to be said, \"India is the largest peninsula,\" [https://books.google.com/books?id=Jb4XAAAAIAAJ&pg=PA67#v=onepage&q&f=false here], for example, but in which of its pages Wikipedia might accommodate the piece of interesting trivia is not clear.","user":"Fowlerfowler"},{"date":"2020-10-18T01:37:00Z","id":8,"parent_id":0,"section":"Extended-confirmed-protected edit request on 18 October 2020","text":"{{edit extended-protected|India|answered=yes}}\n* Please add the following in ‘Industries’ :\n{{quote|India’s aviation industry is largely untapped with huge growth opportunities, considering that air transport is still expensive for majority of the country’s population, of which nearly 40 per cent is the upwardly mobile middle class. \nThe industry stakeholders should engage and collaborate with policy makers to implement efficient and rational decisions that would boost India’s civil aviation industry. With the right policies and relentless focus on quality, cost and passenger interest, India would be well placed to achieve its vision of becoming the third-largest aviation market by 2020. The expenditure of Indian travellers is expected to grow up to Rs 9.5 lakh crore (US$ 136 billion) by 2021. Due to rise in demand in air travel, India will need 2,380 new commercial airplanes by 2038.Brand India. (n.d.). Retrieved October 18, 2020, from https://www.ibef.org/industry/indian-aviation.aspx}}\n* Please add the following in ‘Culture’ > Clothing :\n{{quote|The Lungi (/luŋɡi/) or Tahband is a type of sarong that originated in the Indian subcontinent, it is a traditional skirt-like lower garment wrapped around the waist, usually below the belly. Apart from India, lungis are also worn in Sri Lanka, Bangladesh, Pakistan, and Nepal.Lungi. (2020, September 27). Retrieved October 18, 2020, from https://en.wikipedia.org/wiki/Lungi}}\n* Please add the following in ‘Culture’ > Cuisine : \n{{quote|Bengali cuisine generally involves a hot palette, using a large number of herbs, spices and roots in order to create dishes that are full of depth. However, these flavors can also be manipulated to create more delicate tastes, and it is important to note that dishes vary from region to region. The areas of West Bengal and Bangladesh are interesting for both their similar qualities, and inherent differences.Pearce, M. (2013, July 10). Defining Bengali Cuisine: The Culinary Differences of West Bengal and Bangladesh. Retrieved October 18, 2020, from https://theculturetrip.com/asia/bangladesh/articles/defining-bengali-cuisine-the-culinary-differences-of-west-bengal-and-bangladesh/}}\n-- [[User:Gg100699|Gg100699]] ([[User talk:Gg100699|talk]]) 01:37, 18 October 2020 (UTC)","user":"Gg100699"},{"date":"2020-10-18T01:52:00Z","id":9,"parent_id":0,"section":"Extended-confirmed-protected edit request on 18 October 2020","text":"{{Reflist-talk}}\n:[[File:Red information icon with gradient background.svg|20px|link=|alt=]] Not done: A major change such as this can not be implemented without [[WP:CONSENSUS]]. Please reactivate this request only after you've achieved one. On a personal note, your first suggestion is contra [[WP:NOTADVICE]], while the rest may or may not fit into the article as you have not provided the location within the sections where they would be appropriate, though at first glance, they seem too detailed for this article. See [[WP:DETAIL]]. Best,","user":"Usedtobecool"},{"date":"2020-10-22T14:08:00Z","id":10,"parent_id":0,"section":"Extended-confirmed-protected edit request on 22 October 2020","text":"{{edit extended-protected|India|answered=yes}}\nAdd \"Despite the modern reforms brought by British Rule, they were also infamous for atrocities over Indians, most notably during the Jallianwala Bagh Incident, in Amritsar, and the involvement of British Rule in the Bengal Famine during the second world war.\"","user":"223.181.89.146"},{"date":"2020-10-22T14:19:00Z","id":11,"parent_id":10,"section":"Extended-confirmed-protected edit request on 22 October 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate. –","user":"Jonesey95"},{"date":"2020-10-24T13:50:00Z","id":12,"parent_id":0,"section":"Extended-confirmed-protected edit request on 24 October 2020","text":"{{edit extended-protected|India|answered=yes}}\nIndia has 29 states. There are also 7 union territories. Telangana is a state... The article need correction\n","user":"Pointsuccess"},{"date":"2020-10-24T17:05:00Z","id":13,"parent_id":12,"section":"Extended-confirmed-protected edit request on 24 October 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate. [[User:Asartea|Asartea]] [[User Talk:Asartea|Trick]] |","user":"Asartea"},{"date":"2020-11-05T08:55:00Z","id":14,"parent_id":13,"section":"Extended-confirmed-protected edit request on 24 October 2020","text":"{{ping|Asartea}}, [[Telangana]] is also a state of India. But it is not completely clear yet. There are 8 union territories. [https://knowindia.gov.in/states-uts/ Click here]  to view source.","user":"Dineshswamiin"},{"date":"2020-11-05T08:47:00Z","id":15,"parent_id":0,"section":"Error check","text":"Please check Modern humans arrived on the Indian subcontinent from Africa no later than 55,000 years ago this line and view [[Peopling of India]] article. \"[[Peopling of India]]\" shows that modern humans came to India 65000 years ago, not 55000. Thank you!","user":"Dineshswamiin"},{"date":"2020-11-05T16:04:00Z","id":16,"parent_id":15,"section":"Error check","text":"The sentence is well sourced in this article so it cannot the changed. Note that it says \"no later than\", which doesn't preclude the 65000 year date. Also note that the 65,000 years appears to be unsourced in [[Peopling of India]].--","user":"RegentsPark"},{"date":"2020-11-09T11:38:00Z","id":17,"parent_id":15,"section":"Error check","text":"It is likely to be earlier, but there is no known fossil evidence. See [https://books.google.com/books?id=Qm9GfjNlnRwC&pg=PA246&dq=modern+humans+Indian+subcontinent&hl=en&sa=X&ved=2ahUKEwiclrm8r_XsAhWpA2MBHaVRDLQQ6AEwAXoECAQQAg#v=onepage&q=modern%20humans%20Indian%20subcontinent&f=false].--","user":"Hippeus"},{"date":"2020-11-14T20:46:00Z","id":18,"parent_id":0,"section":"Extended-confirmed-protected edit request on 14 November 2020","text":"{{edit extended-protected|India|answered=yes}}\nBlatant tampering being done on this page by fascists islamists on this page.\nOpenly trying to demean non-islamic rulers/kingdoms-\n\n\"Early political consolidations gave rise to the loose-knit Maurya and Gupta Empires based in the Ganges Basin.[31] Their collective era was suffused with wide-ranging creativity,[32] but also marked by the declining status of women,[33] and the incorporation of untouchability into an organised system of belief.[g][34]\" \nWhile also trying to glorify violent and fascist islamic rule-\n\n\"The Mughal Empire, in 1526, ushered in two centuries of relative peace,[41] leaving a legacy of luminous architecture.[h][42\"\n\nRequest these lines be taken down or removed. Lines are specifically selected from outlier sources in order to push propaganda.","user":"Bekknqz"},{"date":"2020-11-15T18:04:00Z","id":19,"parent_id":18,"section":"Extended-confirmed-protected edit request on 14 November 2020","text":"{{notdone}} The material appears to be well sourced. --","user":"RegentsPark"},{"date":"2020-11-17T08:10:00Z","id":20,"parent_id":0,"section":"Extended-confirmed-protected edit request on 17 November 2020","text":"{{edit extended-protected|India|answered=yes}}\nThis is some blatant next-level disinformation campaign. Do you think the rest of us here don't have access to the sources or do you think we're too dumb to comprehend?\n\n1. A Population History of India: From the First Modern People to the Present Day By Tim Dyson\n\np. 16-17 \nThe term loose-knit was used to refer to the Mauryan Empire, no mention of the Gupta Empire anywhere.\n\nAnd ironically, the first mention of the Gupta Empire in the book is on p. 38, where the author refers to the Gupta Empire as one of the two empires with a central authority in the subcontinent (the other one being the one led by Harsha-vardhana). The attempt to talk about the two empires them collectively is clearly aimed at bashing them.\n\n2. A Population History of India: From the First Modern People to the Present Day By Tim Dyson\n\np. 20\nOnce again, no mention of the Gupta Empire. And the page only takes about how the society changed in that period (uses the empire to denote a time period). It didn't have anything to do with Mauryas or any of their policies. And this crucial distinction has conveniently been left out to make it look as if the Mauryas were directly responsible for these social issues.\n\n(slightly off topic)\nAnd what exactly was the point of mentioning this in the intro though? If you wanted to talk about the declining status of women then why not include how the rigorized version of the purdah system introduced by islamic rulers degraded the status of women and widened the gender divide? There are plenty of sources on this. Dr. Alice Evans has various sources on this in her blog (has a book coming up too). Do explain why these particular lines were allowed in the intro, because it's very clear that these were aimed at degrading these kingdoms (adding the word \"creativity\" is a very poor attempt at sugarcoating it). Gupta Empire is considered to be the golden age (something intro worthy) of Indian history, but of course, no mention of it anywhere.\n\n3. A History of India By Professor of Asian History Hermann Kulke, Dietmar Rothermund\n\np. 93\nFaxian visited during the reign of Chandragupta II (Gupta Empire), has nothing to do with the Mauryas.\n\n4. India Before Europe by Catherine B. Asher, Cynthia Talbot\n\np. 152\nIt was AKBAR who ushered in a period of relative peace. Replacing \"Akbar\" with \"Mughals\" only shows malicious intent. What's exactly the harm in being specific that it was Akbar and not some other Mughal ruler? Also, the previous page clearly says: \"Akbar's policy of toleration remained\nlargely intact through the reigns of the next two Mughal emperors, although over time the empire took on increasingly conservative attitudes toward religion.\"\nWhy was such an important and relevant (yet brief) point left out in exchange for substituting 'Akbar' with 'Mughals'?\n\n5. \"luminous architecture\"? The book doesn't use these words anywhere. Unnecessary paraphrasing to over-emphasize.\n\nNot gonna let fascist propaganda take over Wikipedia. Everyone here has access to all these sources and you can't blatantly dismiss stuff by simply labelling it \"well sourced\", even though half the things aren't even in the sources to begin with. \nI know I'm supposed to suggest appropriate changes too, but I'll let you handle them accordingly.","user":"Bekknqz"},{"date":"2020-11-17T14:13:00Z","id":21,"parent_id":20,"section":"Extended-confirmed-protected edit request on 17 November 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate. –","user":"Jonesey95"},{"date":"2020-11-19T17:06:00Z","id":22,"parent_id":0,"section":"Extended-confirmed-protected edit request on 19 November 2020","text":"{{edit extended-protected|India|answered=yes}}\nDriving Left to Right\n\nThe driving side in india is on Right side.","user":"Sameer Rolekar"},{"date":"2020-11-19T17:08:00Z","id":23,"parent_id":22,"section":"Extended-confirmed-protected edit request on 19 November 2020","text":"{{notdone}} Please provide [[WP:RS|reliable sources]] that support the change. --","user":"RegentsPark"}]