[{"date":"2020-08-15T19:12:00Z","id":1,"parent_id":0,"section":"Extended-confirmed-protected edit request on 15 August 2020","text":"{{edit extended-protected|India|answered=yes}}\nPlease remove the following line:\n\"The Dravidian languages of India were supplanted in the northern regions.[28]\".\nThe lines from the referenced book says the Dravidian languages were probably used in the states of Maharashtra, Gujrat and Sindh. These are considered western parts of the subcontinent and as such a very small section of the Indian Subcontinent in this context.","user":"Athosindia"},{"date":"2020-08-22T21:28:00Z","id":2,"parent_id":1,"section":"Extended-confirmed-protected edit request on 15 August 2020","text":"{{re|Athosindia}} I changed \"in the northern regions\" to \"in some regions\" - but that's probably not the best phrasing.  I'm leaving your request open in the hopes someone more familiar with Indian geography can read pages 16 and 24 of the book and make the sentence more precise and accurate.  The book is available on Google Books at <nowiki>https://www.google.com/search?q=\"The+Dravidian+languages+of+India+were+supplanted+in+the+northern+regions\"&tbm=bks</nowiki>.  Just scroll down to A Population History of India: From the First Modern People ... by Tim Dyson, 2018.  [[User:davidwr|davidwr]]/([[User_talk:davidwr|talk]])/","user":"Davidwr"},{"date":"2020-08-23T01:18:00Z","id":3,"parent_id":2,"section":"Extended-confirmed-protected edit request on 15 August 2020","text":"I changed it to northern and western regions because \"some\" is too fuzzy. I think northern was sufficient (because it means \"regions toward the north of the subcontinent\" not North India) but, hopefully, someone else will figure this out. --","user":"RegentsPark"},{"date":"2020-08-25T15:27:00Z","id":4,"parent_id":3,"section":"Extended-confirmed-protected edit request on 15 August 2020","text":"{{re|RegentsPark}} That's exactly the problem I pointed out, the regions mentioned are considered western parts of the subcontinent. Please check the map, the provinces mentioned are all coastal regions and in the western part of Indian subcontinent. I would've preferred \"Some\", but if we need to be specific, we can mention \"western regions\". Also please note that the above mentioned states are in the [[Western Zonal Council|Western Zone]] as per Government of India. --[[User:Athosindia|Athosindia]]\n::::I guess I'm unsure what that sentence really means. The source seems to say that the language in IVC was proto-Dravidian and the IVC is certainly in the north and the west of pre-partition India. The implication is that Dravidian speakers were pushed southward, which would also support using northern rather than western (parallelism). \"Some\" is too fuzzy to be retained, we need to be more specific than that. If you say \"western\", we lose the southward movement. Which is why I went with northern and western. Perhaps we should just remove that sentence entirely but I'll {{ping|Fowler&fowler}} since he probably wrote it in the first place. --","user":"RegentsPark"},{"date":"2020-09-03T20:16:00Z","id":5,"parent_id":4,"section":"Extended-confirmed-protected edit request on 15 August 2020","text":"{{re|RegentsPark}} Actually, that's the other thing. The source says that the language used in IVC may have been proto-Dravidian, but it's hard to assess. So technically, it's a conjecture at this point. However what the source says with certainty is that Dravidian languages were used in provinces of  Maharashtra, Gujrat and Sindh. Also, the source doesn't mention any southward movement. It just says, Dravidian languages were used in most of  the west of the subcontinent --[[User:Athosindia|Athosindia]]\n:[[File:Yellow check.svg|20px|link=|alt=]] Partly done: Changed text to \"northwestern regions of the subcontinent ([[Maharashtra]], [[Gujarat]] and [[Sindh]]\" which better matches the text cited and does not get tripped up in the official classifications of states/provinces.","user":"Eggishorn"},{"date":"2020-09-24T12:54:00Z","id":6,"parent_id":4,"section":"Extended-confirmed-protected edit request on 15 August 2020","text":"{{re|Fowler&fowler}} Reopened the edit request as the changes have been reverted. I agree with you, that it's western and not North-western. --[[User:Athosindia|Athosindia]]\n:::{{Not done}} Please establish a [[WP:Consensus]] with whoever reverted the change. I don't want to initiate an [[WP:EDITWAR]]. Once you obtain [[WP:Consensus]], please restart this request and I'd love to re-add the content you wanted.","user":"GreenFrogsGoRibbit"},{"date":"2020-09-17T11:38:00Z","id":7,"parent_id":0,"section":"India","text":"\"India is the Largest Democracy in the world\" is a better statement than \"India is the most populous democracy in the world\". Can someone please change it.","user":"Divyansh indian"},{"date":"2020-09-17T13:20:00Z","id":8,"parent_id":7,"section":"India","text":"{{u|Divyansh indian}}, 'largest democracy' could mean a multitude of things, 'most populous' can only mean one thing. The article avoids ambiguous statements intentionally.","user":"Prolix"},{"date":"2020-09-20T11:14:00Z","id":9,"parent_id":8,"section":"India","text":"Indeed, the largest democracy by area (assuming we eliminate Russia from the race) would be [[Canada]] (followed by US, Brazil, and Australia). \"Most populous\" is precise.--","user":"Hippeus"},{"date":"2020-09-20T13:23:00Z","id":10,"parent_id":9,"section":"India","text":"Indeed.  As you guys have succinctly explained the usage, I'll desist pointing to the long discussions (including a dispute resolution) in which I had once marshalled evidence!","user":"Fowlerfowler"},{"date":"2020-10-07T07:19:00Z","id":11,"parent_id":0,"section":"Hindustan","text":"India is known as Hindustan in hindi language","user":"Eroberar"},{"date":"2020-10-13T08:14:00Z","id":12,"parent_id":0,"section":"Extended-confirmed-protected edit request on 13 October 2020","text":"{{edit extended-protected|India|answered=yes}}\n","user":"2402:8100:282B:7739:0:0:0:1"},{"date":"2020-10-13T08:21:00Z","id":13,"parent_id":12,"section":"Extended-confirmed-protected edit request on 13 October 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate.","user":"Usedtobecool"},{"date":"2020-10-17T02:11:00Z","id":14,"parent_id":0,"section":"Edit- semi-protected","text":"{{edit semi-protected|India|answered=yes}}\nFor the lead, is it possible to add \"a country located on the Indian peninsula in South Asia\"?","user":"2603:8081:160A:BE2A:B1DE:5BA6:F09F:B7AE"},{"date":"2020-10-17T19:16:00Z","id":15,"parent_id":14,"section":"Edit- semi-protected","text":"[[File:Red information icon with gradient background.svg|20px|link=|alt=]] Not done for now: please establish a [[Wikipedia:Consensus|consensus]] for this alteration [[Wikipedia:Edit requests|before]] using the {{tlx|edit extended-protected}} template. In this case, IP2603+, there is no article on the [[Indian Peninsula]] and no mention of it in this article. The lead must summarize the rest of the article. As you may see by clicking the link, the Indian Peninsula is a subtopic of the Indian subcontinent, which actually is mentioned in this article. Thanks again for your input! [[User:Paine Ellsworth|P.I.Ellsworth]][[Editor|ed.]]","user":"Paine Ellsworth"},{"date":"2020-10-18T11:06:00Z","id":16,"parent_id":15,"section":"Edit- semi-protected","text":"Dear {{re|2603:8081:160A:BE2A:B1DE:5BA6:F09F:B7AE}} \"Peninsula,\" from  [[classical Latin]] paeninsula < paene pene- prefix (\"nearly, almost, all but) + insula island has the meaning of \"A piece of land that is almost completely surrounded by water; a piece of land projecting into water, such that the greater part of its boundary is coastline.\" (OED, Third edition, 2005, online, subscription reqd.) Not all of India is peninsular; the Indian Himalayas, for example, are not, the Punjab is not. There is in fact a WP page [[Peninsular India]] which redirects to [[South India]].  Best regards,","user":"Fowlerfowler"},{"date":"2020-10-18T11:23:00Z","id":17,"parent_id":16,"section":"Edit- semi-protected","text":"PS Your proposal is not entirely without precedence in terms of usage, but it is obsolete usage.  It used to be said, \"India is the largest peninsula,\" [https://books.google.com/books?id=Jb4XAAAAIAAJ&pg=PA67#v=onepage&q&f=false here], for example, but in which of its pages Wikipedia might accommodate the piece of interesting trivia is not clear.","user":"Fowlerfowler"},{"date":"2020-10-18T01:37:00Z","id":18,"parent_id":0,"section":"Extended-confirmed-protected edit request on 18 October 2020","text":"{{edit extended-protected|India|answered=yes}}\n* Please add the following in ‘Industries’ :\n{{quote|India’s aviation industry is largely untapped with huge growth opportunities, considering that air transport is still expensive for majority of the country’s population, of which nearly 40 per cent is the upwardly mobile middle class. \nThe industry stakeholders should engage and collaborate with policy makers to implement efficient and rational decisions that would boost India’s civil aviation industry. With the right policies and relentless focus on quality, cost and passenger interest, India would be well placed to achieve its vision of becoming the third-largest aviation market by 2020. The expenditure of Indian travellers is expected to grow up to Rs 9.5 lakh crore (US$ 136 billion) by 2021. Due to rise in demand in air travel, India will need 2,380 new commercial airplanes by 2038.Brand India. (n.d.). Retrieved October 18, 2020, from https://www.ibef.org/industry/indian-aviation.aspx}}\n* Please add the following in ‘Culture’ > Clothing :\n{{quote|The Lungi (/luŋɡi/) or Tahband is a type of sarong that originated in the Indian subcontinent, it is a traditional skirt-like lower garment wrapped around the waist, usually below the belly. Apart from India, lungis are also worn in Sri Lanka, Bangladesh, Pakistan, and Nepal.Lungi. (2020, September 27). Retrieved October 18, 2020, from https://en.wikipedia.org/wiki/Lungi}}\n* Please add the following in ‘Culture’ > Cuisine : \n{{quote|Bengali cuisine generally involves a hot palette, using a large number of herbs, spices and roots in order to create dishes that are full of depth. However, these flavors can also be manipulated to create more delicate tastes, and it is important to note that dishes vary from region to region. The areas of West Bengal and Bangladesh are interesting for both their similar qualities, and inherent differences.Pearce, M. (2013, July 10). Defining Bengali Cuisine: The Culinary Differences of West Bengal and Bangladesh. Retrieved October 18, 2020, from https://theculturetrip.com/asia/bangladesh/articles/defining-bengali-cuisine-the-culinary-differences-of-west-bengal-and-bangladesh/}}\n-- [[User:Gg100699|Gg100699]] ([[User talk:Gg100699|talk]]) 01:37, 18 October 2020 (UTC)","user":"Gg100699"},{"date":"2020-10-18T01:52:00Z","id":19,"parent_id":0,"section":"Extended-confirmed-protected edit request on 18 October 2020","text":"{{Reflist-talk}}\n:[[File:Red information icon with gradient background.svg|20px|link=|alt=]] Not done: A major change such as this can not be implemented without [[WP:CONSENSUS]]. Please reactivate this request only after you've achieved one. On a personal note, your first suggestion is contra [[WP:NOTADVICE]], while the rest may or may not fit into the article as you have not provided the location within the sections where they would be appropriate, though at first glance, they seem too detailed for this article. See [[WP:DETAIL]]. Best,","user":"Usedtobecool"},{"date":"2020-10-22T14:08:00Z","id":20,"parent_id":0,"section":"Extended-confirmed-protected edit request on 22 October 2020","text":"{{edit extended-protected|India|answered=yes}}\nAdd \"Despite the modern reforms brought by British Rule, they were also infamous for atrocities over Indians, most notably during the Jallianwala Bagh Incident, in Amritsar, and the involvement of British Rule in the Bengal Famine during the second world war.\"","user":"223.181.89.146"},{"date":"2020-10-22T14:19:00Z","id":21,"parent_id":20,"section":"Extended-confirmed-protected edit request on 22 October 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate. –","user":"Jonesey95"},{"date":"2020-10-24T13:50:00Z","id":22,"parent_id":0,"section":"Extended-confirmed-protected edit request on 24 October 2020","text":"{{edit extended-protected|India|answered=yes}}\nIndia has 29 states. There are also 7 union territories. Telangana is a state... The article need correction\n","user":"Pointsuccess"},{"date":"2020-10-24T17:05:00Z","id":23,"parent_id":22,"section":"Extended-confirmed-protected edit request on 24 October 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate. [[User:Asartea|Asartea]] [[User Talk:Asartea|Trick]] |","user":"Asartea"},{"date":"2020-11-05T08:55:00Z","id":24,"parent_id":23,"section":"Extended-confirmed-protected edit request on 24 October 2020","text":"{{ping|Asartea}}, [[Telangana]] is also a state of India. But it is not completely clear yet. There are 8 union territories. [https://knowindia.gov.in/states-uts/ Click here]  to view source.","user":"Dineshswamiin"},{"date":"2020-11-05T08:47:00Z","id":25,"parent_id":0,"section":"Error check","text":"Please check Modern humans arrived on the Indian subcontinent from Africa no later than 55,000 years ago this line and view [[Peopling of India]] article. \"[[Peopling of India]]\" shows that modern humans came to India 65000 years ago, not 55000. Thank you!","user":"Dineshswamiin"},{"date":"2020-11-05T16:04:00Z","id":26,"parent_id":25,"section":"Error check","text":"The sentence is well sourced in this article so it cannot the changed. Note that it says \"no later than\", which doesn't preclude the 65000 year date. Also note that the 65,000 years appears to be unsourced in [[Peopling of India]].--","user":"RegentsPark"},{"date":"2020-11-09T11:38:00Z","id":27,"parent_id":25,"section":"Error check","text":"It is likely to be earlier, but there is no known fossil evidence. See [https://books.google.com/books?id=Qm9GfjNlnRwC&pg=PA246&dq=modern+humans+Indian+subcontinent&hl=en&sa=X&ved=2ahUKEwiclrm8r_XsAhWpA2MBHaVRDLQQ6AEwAXoECAQQAg#v=onepage&q=modern%20humans%20Indian%20subcontinent&f=false].--","user":"Hippeus"},{"date":"2020-11-14T20:46:00Z","id":28,"parent_id":0,"section":"Extended-confirmed-protected edit request on 14 November 2020","text":"{{edit extended-protected|India|answered=yes}}\nBlatant tampering being done on this page by fascists islamists on this page.\nOpenly trying to demean non-islamic rulers/kingdoms-\n\n\"Early political consolidations gave rise to the loose-knit Maurya and Gupta Empires based in the Ganges Basin.[31] Their collective era was suffused with wide-ranging creativity,[32] but also marked by the declining status of women,[33] and the incorporation of untouchability into an organised system of belief.[g][34]\" \nWhile also trying to glorify violent and fascist islamic rule-\n\n\"The Mughal Empire, in 1526, ushered in two centuries of relative peace,[41] leaving a legacy of luminous architecture.[h][42\"\n\nRequest these lines be taken down or removed. Lines are specifically selected from outlier sources in order to push propaganda.","user":"Bekknqz"},{"date":"2020-11-15T18:04:00Z","id":29,"parent_id":28,"section":"Extended-confirmed-protected edit request on 14 November 2020","text":"{{notdone}} The material appears to be well sourced. --","user":"RegentsPark"}]
