[{"date":"2020-08-05T15:12:00Z","id":1,"parent_id":0,"section":"Please consider for inclusion","text":"Can this image of Modi from the Ram Mandir bhoomi puja on 5 August 2020 be included? - [[:File:The Prime Minister, Shri Narendra Modi performing Bhoomi Pujan at ‘Shree Ram Janmabhoomi Mandir’, in Ayodhya, Uttar Pradesh on August 05, 2020.jpg]]","user":"DiplomatTesterMan"},{"date":"2020-08-12T10:09:00Z","id":2,"parent_id":1,"section":"Please consider for inclusion","text":"Include in Hindutva sub section with a brief detail about the event.","user":"Manasbose"},{"date":"2020-08-06T12:26:00Z","id":3,"parent_id":0,"section":"Semi-protected edit request on 6 August 2020","text":"{{edit semi-protected|Narendra Modi|answered=yes}}\nRemove the New Delhi Riot section","user":"112.79.110.73"},{"date":"2020-08-06T12:40:00Z","id":4,"parent_id":3,"section":"Semi-protected edit request on 6 August 2020","text":"[[File:Red question icon with gradient background.svg|20px|link=|alt=]] Not done: it's not clear what changes you want to be made. Please mention the specific changes in a \"change X to Y\" format and provide a [[Wikipedia:Reliable sources|reliable source]] if appropriate.","user":"Cannolis"},{"date":"2020-08-11T14:22:00Z","id":5,"parent_id":0,"section":"\"Background\" section for elections","text":"Speculation about a politician becoming prime minister is hardly an uncommon thing. Unless it's referred to by reliable sources writing substantially after the fact, such speculation falls foul of NOTNEWS, and does not belong in the article.","user":"Vanamonde93"},{"date":"2020-08-11T15:24:00Z","id":6,"parent_id":5,"section":"\"Background\" section for elections","text":"I'd argue, even if there are RS writing about the past election runup now, why do we need that in this article? Who cares what, for instance, Raj Thackeray, had to say about Modiji then. Every politician and their grandmother had something to say about Modiji. Why include that non-sense?  [[WP:BALASPS]] is very clear about this. Maybe {{yo|User:Manasbose}} has something to say. -","user":"Hako9"},{"date":"2020-08-11T15:52:00Z","id":7,"parent_id":0,"section":"\"Background\" section for elections","text":"Hi. I believe giving a background is very much needed. In the CM section there is already a brief description how modi became CM choice of the party. But for PM it just starts with Modi was announced PM candidate. No background is given. He was definitely a notable politician in 2013. But that doesn't answers why many senior officials of the party were avoided and Modi was chosen? India does not have any internal party primaries. And Modi was also opposed by many (even long time alliances broke due to that). And about notability of endorsements, Raj Thackeray is a opposition leader of BJP, hence I believe his statement was significant. And one more thing, I also plan to add some opinion polls about Modi in that segment.{{ping|Vanamonde93|hako9}}","user":"Manasbose"},{"date":"2020-08-11T15:59:00Z","id":8,"parent_id":7,"section":"\"Background\" section for elections","text":"And if anyone finds some of the sentences not notable enough that's ok. But a background is very much needed.","user":"Manasbose"},{"date":"2020-08-11T17:49:00Z","id":9,"parent_id":8,"section":"\"Background\" section for elections","text":"The background you added does not conform to [[WP:DUE]] or [[WP:SYNTH]]. Modi has been a major political figure for nearly twenty years now. Business people and other politicians have been producing soundbytes about him for at least that long. They are generally undue weight in the article, because they are reported on when they are said and never mentioned afterwards. If you wish to write a background section for his electoral history, at the very least you need to base it on sources looking retrospectively.","user":"Vanamonde93"},{"date":"2020-08-24T09:01:00Z","id":10,"parent_id":0,"section":"Image in Infobox","text":"We should come to a consensus on what image should be used in the Infobox to avoid edit wars.","user":"Manasbose"},{"date":"2020-08-24T09:11:00Z","id":11,"parent_id":10,"section":"Image in Infobox","text":"I nominate [[:File:Prime Minister, Shri Narendra Modi, in New Delhi on August 08, 2019 (cropped).jpg]].","user":"Manasbose"},{"date":"2020-08-24T09:14:00Z","id":12,"parent_id":10,"section":"Image in Infobox","text":"{{ping|Aman.kumar.goel|Sdg100|Showbiz826}} you might want to comment on this.","user":"Manasbose"},{"date":"2020-08-24T14:53:00Z","id":13,"parent_id":10,"section":"Image in Infobox","text":"* [[:File:Prime Minister, Shri Narendra Modi, in New Delhi on August 08, 2019 (cropped).jpg]] on [[Narendra Modi]]\n: * [[:File:Shri Narendra Modi.jpg]] on [[Prime Minister of India]]\n: I will recommend [[:File:Prime Minister, Shri Narendra Modi, in New Delhi on August 08, 2019 (cropped).jpg]] for article [[Narendra Modi]] and [[:File:Shri Narendra Modi.jpg]] for article [[Prime Minister of India]]. The file being pushed by {{u|Sdg100}} is yet to be reviewed any reviewer. Further, any wikipedia policy doesn't mandate us to keep official portraits on articles. Licensed image without any copyvio in public domain in highest available resolution is what I recommend. The [[:File:Prime Minister, Shri Narendra Modi, in New Delhi on August 08, 2019 (cropped).jpg|photo]] I and Manasbose back for [[Narendra Modi]] is recent, covers him upto his body, having camera at inclination and not opposite to face, hence provides an entire profile of his face and looks better. Meanwhile the one given by Sdg100 is a straight standstill mirror image that won't even allow to recognise the character in other expressions. For [[Prime Minister of India]], [[:File:Shri Narendra Modi.jpg]] is strongly backed from me given its nice resolution and Indian flag in background (for representative of Indian republic).","user":"Aman.kumar.goel"},{"date":"2020-08-24T15:19:00Z","id":14,"parent_id":0,"section":"Image in Infobox","text":"I recommend [[:File:PM Narendra Modi.jpg]] for both [[Narendra Modi]] and [[Prime Minister of India]] pages because this is the official portrait of him.","user":"Sdg100"},{"date":"2020-08-24T15:21:00Z","id":15,"parent_id":0,"section":"Image in Infobox","text":"I recommend File:PM Narendra Modi.jpg for both [[Narendra Modi]] and [[Prime Minister of India]] pages because the image is very good and this is the official portrait and can be used anywhere easily.","user":"Sdg100"},{"date":"2020-08-30T10:00:00Z","id":16,"parent_id":15,"section":"Image in Infobox","text":"We were not using copyrighted portraits earlier either, and those were much better than this one with just front elevation plus no background. I don't find any Wikipedia policy necessitating use of official portraits. You should stop reverting to an unreviewed file.","user":"Aman.kumar.goel"},{"date":"2020-08-30T11:00:00Z","id":17,"parent_id":15,"section":"Image in Infobox","text":"CC-by-SA photos are best, avoids copyright.--","user":"Hippeus"},{"date":"2020-08-30T13:08:00Z","id":18,"parent_id":17,"section":"Image in Infobox","text":"I'd suggest a mug shot (passport style) portrait for the Modi article. It is customary (imo) to use a straight passport style photograph for the infobox and, both the ones nominated by Akg, are sideways shots. If you can find a straight shot that is cc-by-sa, that would probably be better. --","user":"RegentsPark"},{"date":"2020-09-05T07:57:00Z","id":19,"parent_id":18,"section":"Image in Infobox","text":"As told before, I back so for profile for face. Still there are many other images available than this unreviewed file if concensus tilts in favour of a photo with front elevation of face.","user":"Aman.kumar.goel"},{"date":"2020-08-30T17:07:00Z","id":20,"parent_id":0,"section":"Image in Infobox","text":"*We should not be using a copyrighted photo when so many free-use images are available. I don't see how a copyrighted portrait of Modi would qualify for an [[WP:NFUR]] in any case.","user":"Vanamonde93"},{"date":"2020-09-21T09:25:00Z","id":21,"parent_id":0,"section":"Request for the image to be applied on the page.","text":"I request to use the file [[:File:PM Narendra Modi.jpg]] in this page because this is the official portrait of the Prime Minister of India. Apart from that, this image is also used in the [[Prime Minister of India]] page.","user":"Sdg100"},{"date":"2020-09-25T17:33:00Z","id":22,"parent_id":0,"section":"Gujrat Riots","text":"@RegentsPark what kind of stupidity is this? You have reinstated these lines \"It was considered that his government was complicit with the riots\" while supreme court and other agencies did not find any evidence. Why are you trying to keep false information?","user":"ManojAvadhani"},{"date":"2020-09-25T17:41:00Z","id":23,"parent_id":22,"section":"Gujrat Riots","text":"{{ping|ManojAvadhani}} If reliable sources consider him complicit in the riots, then we say just that. Court rulings can be mentioned (and, clearly, they are in this case) but we stick to reliable secondary sources for our main points. Please read up on [[WP:RS]]. --","user":"RegentsPark"},{"date":"2020-09-25T17:48:00Z","id":24,"parent_id":0,"section":"Gujrat Riots","text":"@RegentaPark Is what you are doing not against contempt of court? Who ever writes filth will that become reliable source? \nSo you are ready to tarnish image of a person who has got astounding mandate of people of India twice because your \"reliable source\" says so?","user":"ManojAvadhani"},{"date":"2020-09-25T18:03:00Z","id":25,"parent_id":24,"section":"Gujrat Riots","text":"{{re|ManojAvadhani}} Please read [[WP:RS]], as RegentsPark asked you to, and also read [[WP:DUE]], which is very relevant here. Please also remember that [[WP:NLT|making legal threats]] is not permitted on Wikipedia, and if you didn't intend to imply a threat of legal action, you should choose your words more carefully.","user":"Vanamonde93"},{"date":"2020-09-26T08:49:00Z","id":26,"parent_id":0,"section":"President order","text":"My edit was reverted despite providing proper details not sure why Mods don't take time to read and mull over it. Anyways, all the previous prime minister and president profile has their counterpart listed inorder of office held. So, in case of current PM the order should be Pranab Mukherjee and then Ram Nath Kovind and after 2022 whoever holds the office not the other way around.","user":"Shashpant"},{"date":"2020-09-26T09:32:00Z","id":27,"parent_id":26,"section":"President order","text":"Hi {{u|Shashpant}}, I reverted them because I was not sure if that was the preferred way to order them. However, it does seem like most other pages order them chronologically. Maybe someone else can help us clarify this.","user":"Prolix"},{"date":"2020-09-26T17:08:00Z","id":28,"parent_id":27,"section":"President order","text":"A chronological order would make sense to me, if only because if we do it some other way without explaining why, readers may well assume it's chronological.","user":"Vanamonde93"},{"date":"2020-09-26T17:32:00Z","id":29,"parent_id":28,"section":"President order","text":"Thanks for clarifying, {{u|Vanamonde93}}. I'll make the change","user":"Prolix"},{"date":"2020-11-10T11:45:00Z","id":30,"parent_id":0,"section":"Narendra modi image","text":"Hello Freinds I recently update photo of modi From 2013 event but a user revert it kindly dont revert such friendly changes, I am re adding that photo please dont do that its ok to have photo of few years back, Hope u all agree with me.","user":"Aristocratic 536"}]
